Revit 2027 API
Family.CurtainPanelVerticalSpacing Property
 For Curtain Panel families, the vertical spacing of the driving mesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CurtainPanelVerticalSpacing { get; set; }
Public Property CurtainPanelVerticalSpacing As Double
	Get
	Set
public:
property double CurtainPanelVerticalSpacing {
	double get ();
	void set (double value);
}
member CurtainPanelVerticalSpacing : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if this family is not the owner family of a curtain panel family document.
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace